---
kind: other
id: Properties.T:Autodesk.Revit.DB.ContentNode
source: html/e5ae41c2-dcdb-8706-de79-3be04143b6b2.htm
---
# ContentNode Properties

Specifies whether the .NET object represents a valid Revit entity.